# 05_pandas

### Pandas는 오픈소스인 R을 python 언어로 옮겨온 것
- R의 자료구조 중 벡터와 데이터프레임을 시리즈(Series)와 데이터프레임(DataFrame)으로 제공합니다.

### 시리즈 클래스
- Numpy의 배열과 비슷하지만 각 데이터의 의미를 표시하는 index를 붙일 수 있다.

In [1]:
import numpy as np # numpy를 np로 줄임
import pandas as pd # pandas를 pd로 줄임

In [2]:
s = pd.Series([1, 2, 3, 4])

In [3]:
s

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
# 조회하기
print(s[0])
print(s[1])
print(s[0:3])
print(s[[0, 2]])

1
2
0    1
1    2
2    3
dtype: int64
0    1
2    3
dtype: int64

In [5]:
# 실습하기. s의 1번째 방의 값을 10으로 수정해주세요.
print(s[1])
s[1] = 10
print(s)

2
0     1
1    10
2     3
3     4
dtype: int64

In [6]:
# 실습하기. np를 이용해서 0-10까지 Series를 만들어주세요
a = np.arange(0, 11) # 0 ~ 10
pd.Series(a)

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
dtype: int32

In [7]:
# 조회하기
pd.Series(np.arange(0, 11))[2]

2

In [8]:
# 인덱스를 가진 시리즈 만들기
s = pd.Series([900000, 340000, 280000, 240000], index=['서울', '부산', '인천', '대구'])
s

서울    900000
부산    340000
인천    280000
대구    240000
dtype: int64

In [9]:
# 조회하기
print(s[0])
print(s[1])
print(s['서울'])
print(s['부산'])
# 실습하기. 인천의 값을 조회해주세요
print(s['인천'])

900000
340000
900000
340000
280000

In [10]:
s.name = '인구'
s.index.name = '도시'
s

도시
서울    900000
부산    340000
인천    280000
대구    240000
Name: 인구, dtype: int64

In [11]:
# 인덱스 따로 생성하기
dates = pd.date_range('2022-02-01', '2022-02-06')
dates

DatetimeIndex(['2022-02-01', '2022-02-02', '2022-02-03', '2022-02-04',
               '2022-02-05', '2022-02-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
temp1 = pd.Series([80, 82, 85, 90, 83, 87], index = dates)
temp2 = pd.Series([70, 75, 200, 83, 79, 77], index = dates)
print(temp1)
print(temp2)

2022-02-01    80
2022-02-02    82
2022-02-03    85
2022-02-04    90
2022-02-05    83
2022-02-06    87
Freq: D, dtype: int64
2022-02-01     70
2022-02-02     75
2022-02-03    200
2022-02-04     83
2022-02-05     79
2022-02-06     77
Freq: D, dtype: int64

In [13]:
# 같은 index이므로 사칙연산 가능
print(temp1 - temp2)
print(temp1 + temp2)

2022-02-01     10
2022-02-02      7
2022-02-03   -115
2022-02-04      7
2022-02-05      4
2022-02-06     10
Freq: D, dtype: int64
2022-02-01    150
2022-02-02    157
2022-02-03    285
2022-02-04    173
2022-02-05    162
2022-02-06    164
Freq: D, dtype: int64

In [14]:
# 함수
print(temp1.mean()) # 평균
print(temp1.sum()) # 함

84.5
507

In [15]:
# 데이터프레임 만들기
temps_df = pd.DataFrame({'서울':temp1, '부산':temp2})
temps_df

            서울   부산
2022-02-01  80   70
2022-02-02  82   75
2022-02-03  85  200
2022-02-04  90   83
2022-02-05  83   79
2022-02-06  87   77

In [16]:
temps_df['서울']

2022-02-01    80
2022-02-02    82
2022-02-03    85
2022-02-04    90
2022-02-05    83
2022-02-06    87
Freq: D, Name: 서울, dtype: int64

In [17]:
temps_df.부산 # 한글('부산')인 경우는 사용하면 안됨

2022-02-01     70
2022-02-02     75
2022-02-03    200
2022-02-04     83
2022-02-05     79
2022-02-06     77
Freq: D, Name: 부산, dtype: int64

In [18]:
# 열 추가하기
temp = temps_df['서울'] - temps_df['부산']
temp
temps_df['diff'] = temp
temps_df

            서울   부산  diff
2022-02-01  80   70    10
2022-02-02  82   75     7
2022-02-03  85  200  -115
2022-02-04  90   83     7
2022-02-05  83   79     4
2022-02-06  87   77    10

In [19]:
temps_df['diff'] >= 10

2022-02-01     True
2022-02-02    False
2022-02-03    False
2022-02-04    False
2022-02-05    False
2022-02-06     True
Freq: D, Name: diff, dtype: bool

In [20]:
# 온도차가 10도 이상인 날만 출력하기
temps_df[temps_df['diff'] >= 10]

            서울  부산  diff
2022-02-01  80  70    10
2022-02-06  87  77    10